### Q 1: Import pandas and read in the banklist.csv file into a dataframe called banks.

In [5]:
import pandas as pd
banks = pd.read_csv(r"c:\Users\shubh\OneDrive\Desktop\Tops DA\banklist.csv")
pd.DataFrame(banks)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,26-Jul-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,26-Jul-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,26-Jul-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
...,...,...,...,...,...,...,...
548,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
549,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
550,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
551,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
552,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

### Q 2: Show the head of the dataframe.

In [ ]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,26-Jul-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,26-Jul-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,26-Jul-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

### Q 3:What are the column names?

In [ ]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

### Q 4:How many States (ST) are represented in this data set?

In [ ]:
banks['ST'].count()

np.int64(553)

### Q 5:Get a list or array of all the states in the data set.

In [ ]:
banks.ST.unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

### Q 6:What are the top 5 states with the most failed banks?

In [6]:
top_states = banks["ST"].value_counts().head(5)
print("Top 5 states with most failed banks:")
print(top_states)
top_banks = banks['Bank Name'].value_counts().head(5)
print("\nTop 5 most repeated bank names:")
print(top_banks)

Top 5 states with most failed banks:
ST
GA    93
FL    75
IL    68
CA    41
MN    23
Name: count, dtype: int64

Top 5 most repeated bank names:
Bank Name
Horizon Bank        3
Premier Bank        3
First State Bank    3
Valley Bank         2
Legacy Bank         2
Name: count, dtype: int64

### Q 7:What are the top 5 acquiring institutions?

In [ ]:
banks['Acquiring Institution'].head(5)

0              United Fidelity Bank, fsb
1    First-Citizens Bank & Trust Company
2                           Whitney Bank
3                      Cache Valley Bank
4                    State Bank of Texas
Name: Acquiring Institution, dtype: object

### Q 8:How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?

In [ ]:
acquired_banks = banks[banks['Acquiring Institution'] == 'State Bank of Texas'].shape[0]
print(f"Acquired by State bank of texas: {acquired_banks}")
total_acquired = banks[banks['ST'] == 'TX'].shape[0]
print(f"Number of acquired bank in texas: {total_acquired}")

Acquired by State bank of texas: 3
Number of acquired bank in texas: 12

### Q 9: What is the most common city in California for a bank to fail in?

In [ ]:
california_banks = banks[banks['ST'] == 'CA']
most_common_city = california_banks['City'].value_counts().idxmax()
most_common_city

'Los Angeles'